app/views/widgets/index.html.erb

<div class="widget-container">
<% @widgetlist.widgets.each do |l| %>
---
SELECT "widgets".* FROM "widgets"