app/controllers/widgets_controller.rb

  def edit
    @widget = @widgetlist.widgets.find {|widget| widget.id == params[:id].to_i}
---
SELECT  "widgets".* FROM "widgets" WHERE "widgets"."id" = ? LIMIT ?  [["id", 2343], ["LIMIT", 1]]

    def set_widget
      response = RestClient::Request.new({
        method: :get,
        url: ENV['API_URL'] + '/widgets',
        headers: { Authorization: session[:access_token], content_type: 'application/json'}
      }).execute do |response, request, result|
        case response.code
        when 400
          [ :error, JSON.parse(response) ]
        when 200
          [ :success, JSON.parse(response) ]
          json=JSON.parse(response)
          rec = Array.new
          json["data"]["widgets"].each do |item|
              widget= Widget.new
              widget.id=item["id"]
              widget.name=item["name"]
              widget.description=item["description"]
              widget.kind=item["kind"]
              widget.userid=item["user"]["id"]
              widget.username=item["user"]["name"]
              widget.owner=item["owner"]
              rec << widget
---
SELECT "widgets".* FROM "widgets"
INSERT INTO "widgets" ("id", "name", "description", "kind", "userid", "username", "owner", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)